app/Views/qurban/v_kelompok_qurban.php

SELECT *
FROM `anggota_kelompok`
WHERE `id_kelompok` = '1'
SELECT `anggota_kelompok`.`id_kelompok`, SUM(`anggota_kelompok`.`biaya`) AS `biaya`
FROM `anggota_kelompok`
WHERE `id_kelompok` = '1'
GROUP BY `anggota_kelompok`.`id_kelompok`
---
                   </tr>
                   <?php
                    $db = \Config\Database::connect();
                    $anggota = $db->table('anggota_kelompok')
                      ->where('id_kelompok', $value['id_kelompok'])
                      ->get()->getResultArray();
                    $no = 1;

                    foreach ($anggota as $key => $anggota) {
                      $biaya = $db->table('anggota_kelompok')
                        ->where('id_kelompok', $anggota['id_kelompok'])
                        ->select('anggota_kelompok.id_kelompok')
                        ->groupBy('anggota_kelompok.id_kelompok')
                        ->selectSum('anggota_kelompok.biaya')
                        ->get()->getRowArray();