app/Views/front-end/v_peserta_qurban.php

                   </tr>
                   <?php
                    $db = \Config\Database::connect();
                    $peserta = $db->table('peserta_kelompok')
                      ->where('id_kelompok', $value['id_kelompok'])
                      ->get()->getResultArray();
                    $no = 1;

                    foreach ($peserta as $key => $peserta) {
                      $biaya = $db->table('peserta_kelompok')
                        ->where('id_kelompok', $peserta['id_kelompok'])
                        ->select('peserta_kelompok.id_kelompok')
                        ->groupBy('peserta_kelompok.id_kelompok')
                        ->selectSum('peserta_kelompok.biaya')
                        ->get()->getRowArray();
---
SELECT *
FROM `peserta_kelompok`
WHERE `id_kelompok` = '1'
SELECT `peserta_kelompok`.`id_kelompok`, SUM(`peserta_kelompok`.`biaya`) AS `biaya`
FROM `peserta_kelompok`
WHERE `id_kelompok` = '1'
GROUP BY `peserta_kelompok`.`id_kelompok`