app/Models/ModelLogin.php

SELECT *
FROM `user`
WHERE `email` = 'admin@gmail.com'
AND `password` = '12345'
---
    public function CekUser($email, $password)
    {
        return $this->db->table('user')
            ->where('email', $email)
            ->where('password', $password)
            ->get()->getRowArray();