app/Models/ModelAgenda.php

SELECT *
FROM `agenda`
---
    public function AllData()
    {
        return $this->db->table('agenda')
            ->get()->getResultArray();