app/Models/ModelTahun.php

    public function AllData()
    {
        return $this->db->table('tahun')
            ->get()->getResultArray();
---
SELECT *
FROM `tahun`

    public function DetailData($id_tahun)
    {
        return $this->db->table('tahun')
            ->where('id_tahun', $id_tahun)
            ->get()->getRowArray();
---
SELECT *
FROM `tahun`
WHERE `id_tahun` = '1'