app/Models/ModelAdmin.php

SELECT *
FROM `setting`
WHERE `id_setting` = 1
---
    public function ViewSetting()
    {
        return $this->db->table('setting')
            ->where('id_setting', 1)
            ->get()->getRowArray();

SELECT *
FROM `kas_masjid`
WHERE month(tanggal) = '10'
AND year(tanggal) = '2024'
---
    public function AllDataKasMasjid()
    {
        return $this->db->table('kas_masjid')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->get()->getResultArray();

SELECT *
FROM `kas_sosial`
WHERE month(tanggal) = '10'
AND year(tanggal) = '2024'
---
    public function AllDataKasSosial()
    {
        return $this->db->table('kas_sosial')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->get()->getResultArray();