app/Models/ModelHome.php

SELECT *
FROM `agenda`
WHERE month(tanggal) = '10'
AND year(tanggal) = '2024'
ORDER BY `tanggal` ASC
---
    public function Agenda()
    {
        return $this->db->table('agenda')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->orderBy('tanggal', 'ASC')
            ->get()->getResultArray();

SELECT *
FROM `kelompok`
LEFT JOIN `tahun` ON `tahun`.`id_tahun` = `kelompok`.`id_tahun`
WHERE `tahun_m` = '2024'
---
    public function AllDataKelompok()
    {
        return $this->db->table('kelompok')
            ->join('tahun', 'tahun.id_tahun = kelompok.id_tahun', 'left')
            ->where('tahun_m', date('Y'))
            ->get()->getResultArray();

SELECT *
FROM `kas_masjid`
WHERE month(tanggal) = '10'
AND year(tanggal) = '2024'
---
    public function AllDataKasMasjid()
    {
        return $this->db->table('kas_masjid')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->get()->getResultArray();

SELECT *
FROM `kas_sosial`
WHERE month(tanggal) = '10'
AND year(tanggal) = '2024'
---
    public function AllDataKasSosial()
    {
        return $this->db->table('kas_sosial')
            ->where('month(tanggal)', date('m'))
            ->where('year(tanggal)', date('Y'))
            ->get()->getResultArray();