app/Models/ModelRekening.php

    public function AllData()
    {
        return $this->db->table('rekening')
            ->get()->getResultArray();
---
SELECT *
FROM `rekening`