app/Models/ModelPesertaQurban.php

    public function AllDataKelompok($id_tahun)
    {
        return $this->db->table('kelompok')
            ->where('id_tahun', $id_tahun)
            ->get()->getResultArray();
---
SELECT *
FROM `kelompok`
WHERE `id_tahun` = '1'

    public function InsertKelompok($data)
    {
        $this->db->table('kelompok')->insert($data);
---
INSERT INTO `kelompok` (`id_tahun`, `nama_kelompok`) VALUES ('2', 'kelompok 3')