app/Models/ModelKasMasjid.php

    public function AllData()
    {
        return $this->db->table('kas_masjid')
            ->get()->getResultArray();
---
SELECT *
FROM `kas_masjid`

    public function AllDataKasMasuk()
    {
        return $this->db->table('kas_masjid')
            ->where('status', 'Masuk')
            ->get()->getResultArray();
---
SELECT *
FROM `kas_masjid`
WHERE `status` = 'Masuk'

    public function AllDataKasKeluar()
    {
        return $this->db->table('kas_masjid')
            ->where('status', 'Keluar')
            ->get()->getResultArray();
---
SELECT *
FROM `kas_masjid`
WHERE `status` = 'Keluar'

    public function InsertKasMasuk($data)
    {
        $this->db->table('kas_masjid')->insert($data);
---
INSERT INTO `kas_masjid` (`tanggal`, `ket`, `kas_masuk`, `kas_keluar`, `status`) VALUES ('2024-10-20', 'sedekah', '50000', 0, 'Masuk')

    public function DeleteKasKeluar($data)
    {
        $this->db->table('kas_masjid')
            ->where('id_kas_masjid', $data['id_kas_masjid'])
            ->delete($data);
---
DELETE FROM `kas_masjid`
WHERE `id_kas_masjid` = '8'
AND `id_kas_masjid` = '8'

    public function AllDataBulanan($bulan, $tahun)
    {
        return $this->db->table('kas_masjid')
            ->where('month(tanggal)', $bulan)
            ->where('year(tanggal)', $tahun)
            ->get()->getResultArray();
---
SELECT *
FROM `kas_masjid`
WHERE month(tanggal) = '10'
AND year(tanggal) = '2024'