app/Models/ModelKasSosial.php

    public function AllData()
    {
        return $this->db->table('kas_sosial')
            ->get()->getResultArray();
---
SELECT *
FROM `kas_sosial`

    public function InsertKasMasuk($data)
    {
        $this->db->table('kas_sosial')->insert($data);
---
INSERT INTO `kas_sosial` (`tanggal`, `ket`, `kas_keluar`, `kas_masuk`, `status`) VALUES ('2024-10-21', 'sumbangan', '100000', 0, 'Keluar')

    public function AllDataBulanan($bulan, $tahun)
    {
        return $this->db->table('kas_sosial')
            ->where('month(tanggal)', $bulan)
            ->where('year(tanggal)', $tahun)
            ->get()->getResultArray();
---
SELECT *
FROM `kas_sosial`
WHERE month(tanggal) = '10'
AND year(tanggal) = '2024'