app/Views/v_template_admin.php

SELECT *
FROM `setting`
---
<body class="hold-transition sidebar-mini">
  <?php
  $db = \Config\Database::connect();
  $web = $db->table('setting')->get()->getRowArray();